using System.Diagnostics;
using System.Numerics;
using System.Runtime.InteropServices;
using helldivers2;





partial class Program
{
    public static void Main(string[] args)
    {
        string dataDir = @"D:\SteamLibrary\steamapps\common\Helldivers 2\data\";
        string saveDir = @"C:\Users\monta\OneDrive\helldivers2\saved\";
        // string file = "05b7f582b44bac01"; // 4 textures
        // string file = "01710ddcfcdc9e8f"; // 1 texture
        // string file = "fd26c7b93257d7a6";  // no stream file
        string file = "009da023c64d178d"; // huge file with textures, models, etc.
        file = "09985dc611a3a8b6";
        // iterate over all files in data dir with no extension
        // foreach (var file in Directory.EnumerateFiles(dataDir, "*", SearchOption.TopDirectoryOnly))
        // {
        //     if (file.Contains("."))
        //     {
        //         continue;
        //     }
        //
        //     ParseDataFiles(dataDir, saveDir, Path.GetFileNameWithoutExtension(file));
        // }
        ParseDataFiles(dataDir, saveDir, file);
        // SearchBytesInAllFiles(dataDir, "4D762B7CF63061C8");
        // ParseTypeLib();
    }
    
    private static byte[] StringToByteArray(string hex)
    {
        // Convert the string to a byte array.
        hex = hex.Replace(" ", "");
        byte[] bytes = new byte[hex.Length / 2];
        for (int i = 0; i < bytes.Length; i++)
        {
            bytes[i] = Convert.ToByte(hex.Substring(i * 2, 2), 16);

            var relevantunk5s = unk5s.GetRange(unk2.StringGroupOffset10, unk2.StringGroupSize0C);
            stringGroup.Strings = new();
            foreach (var unk5 in relevantunk5s)
            {
                reader.BSeek(stringOffset+unk5.StringDataOffset00);
                stringGroup.Strings.Add(reader.ReadNullTerminatedString());
            }
            reader.BSeek(stringOffset+unk2.StringGroupNameOffset00);
            stringGroup.Name = reader.ReadNullTerminatedString();
            if (unk2.StringGroupExportTypeOffset1C != -1)
            {
                reader.BSeek(stringOffset+unk2.StringGroupExportTypeOffset1C);
                stringGroup.ExportType = reader.ReadNullTerminatedString();
            }
            stringGroups.Add(stringGroup);
        }
        var a = 0;
    }
    
    [StructLayout(LayoutKind.Sequential, Size = 0x50)]
    struct Header
    {
        public UInt32 Magic;
        public UInt32 UnkCount1;  // different types?
        public UInt64 UnkCount2;  // total data count
    }

    [StructLayout(LayoutKind.Sequential, Size = 0x18)]
    struct Unk1  // one for each data type
    {
        public UInt64 TypeId;
        public UInt64 DataCount;
        public UInt32 UnkSize1; // specifies ID size of data header?
        public UInt32 UnkSize2;  // specifies data size of data header?
    }

    [StructLayout(LayoutKind.Sequential, Size = 0x50)]
    struct UnkDataHeader
    {
        public UInt64 UnkId00;
        public UInt64 UnkId08;
        public Int64 DataOffset10;
        public UInt32 StreamDataOffset18;
        public UInt32 Zeros1C;
        public Int64 GPUDataOffset20;
        public UInt64 Unk28;
        public UInt64 Unk30;
        public UInt32 DataSize38;
        public UInt32 StreamDataSize3C;
        public UInt32 GPUDataSize40;
        public UInt32 UnkSize44;
        public UInt32 UnkSize48;
        public UInt32 UnkIndex4C;
    }
    
    [StructLayout(LayoutKind.Sequential, Size = 0xC0)]
    struct TextureHeader
    {
        public UInt32 UnkId00;
        public Int32 Unk04;
        public Int32 Unk08;
        [MarshalAs(UnmanagedType.ByValArray, SizeConst = 0x0F)]
        public List<TextureDetail> TextureDetails;
    }
    
    [StructLayout(LayoutKind.Sequential, Size = 0x0C)]
    struct TextureDetail
    {
        public Int32 DataOffset;
        public Int32 DataSize;
        public Int16 Width;
        public Int16 Height;
    }

    class Texture
    {
        public byte[] DDSHeaderBytes;
        public byte[] DDSData;
    }

    struct Vertex
    {
        public Vector3 Position;
        public Vector2 Texcoord;
        public Vector3 Normal;
    }

    enum ResourceType : ulong
    {
        Texture = 0xCD4238C6_A0C69E32,
        Model = 0xE0A48D0B_E9A7453F,
        Havok = 0x5F7203C8_F280DAB8,
        Material = 0xEAC0B497_876ADEDF,
        Map = 0x2A690FD3_48FE9AC5
    }
    
        
    [StructLayout(LayoutKind.Explicit, Size = 0x68)]
    struct UnkPartHeader
    {
        [FieldOffset(0x08)] public float Unk08;
        [FieldOffset(0x0C)] public float Unk0C;
        [FieldOffset(0x10)] public float Unk10;
        [FieldOffset(0x14)] public float Unk14;
        [FieldOffset(0x18)] public float Unk18;
        [FieldOffset(0x1C)] public float Unk1C;
        [FieldOffset(0x20)] public float Unk20;
        [FieldOffset(0x24)] public int UnkSize24;
        [FieldOffset(0x28)] public uint Unk28;
        [FieldOffset(0x2C)] public int UnkIndex2C;
        [FieldOffset(0x30)] public int UnkIndex30;
        [FieldOffset(0x38)] public int Unk38; // always -1
        [FieldOffset(0x3C)] public int MeshIndex3C; // probably
    }

    [StructLayout(LayoutKind.Sequential, Size = 0x18)]
    struct PartDefinition
    {
        public int Index00;
        public int VertexOffset04;
        public int VertexCount08;
        public int IndexOffset0C;
        public int IndexCount10;
        public uint Zeros14;
    }

    struct Part
    {
        public uint Id;
        public PartDefinition Definition;
        public long MaterialId;
    }

    
    private static void ParseDataFiles(string dataDir, string saveDir, string file)
    {
        var topfile = new HDFile(Path.Combine(dataDir, file));
        HDFile? gpuFile = null;
        HDReader? gpuReader = null;
        HDFile? streamFile = null;
        var reader = topfile.GetReader();
        HDReader? streamReader = null;
        var header = reader.ReadType<Header>();
        List<Unk1> unk1s = new();
        for (int i = 0; i < header.UnkCount1; i++)
        {
